In [186]:
import pandas as pd

In [187]:
df = pd.read_csv('/Users/ypragnesh/Desktop/Pandas_Notes/student_performance.csv')
print(df.head())

  Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
0      S0001   15    Male     12                   65.0         NaN
1      S0002   19  Female      9                   58.0        80.0
2      S0003   14  Female     12                    NaN        83.0
3      S0004   18  Female      9                   68.0        68.0
4      S0005   14    Male     10                   80.0        41.0

   Science_Score  English_Score  Final_Percentage
0            NaN           72.0             50.33
1           44.0           35.0             53.00
2           73.0           59.0             71.67
3            NaN           77.0             64.33
4            NaN           36.0             41.00

In [188]:
# we can rename index 0, 1 and 2 and update the dataframe
df.rename(index={0:'A', 1:'B', 2:'C'}, inplace=True)
df

,Student_ID,Age,Gender,Class,Attendance_Percentage,Math_Score,Science_Score,English_Score,Final_Percentage
A,S0001,15,Male,12,65.0,NaN,NaN,72.0,50.33
B,S0002,19,Female,9,58.0,80.0,44.0,35.0,53.00
C,S0003,14,Female,12,NaN,83.0,73.0,59.0,71.67
3,S0004,18,Female,9,68.0,68.0,NaN,77.0,64.33
4,S0005,14,Male,10,80.0,41.0,NaN,36.0,41.00
...,...,...,...,...,...,...,...,...,...
143,S0144,14,Male,11,94.0,NaN,NaN,82.0,64.33
144,S0145,19,Male,12,56.0,83.0,NaN,97.0,93.00
145,S0146,19,Female,12,NaN,51.0,48.0,44.0,47.67
146,S0147,19,Male,11,54.0,96.0,56.0,50.0,67.33
147,S0148,19,Female,11,91.0,65.0,51.0,65.0,60.33

In [189]:
# here we are changing the index of the dataframe from default integer to student_id 
# for that we have use set_index() method
df.set_index('Student_ID',inplace = True)
print(df)

            Age  Gender  Class  Attendance_Percentage  Math_Score  \
Student_ID
S0001        15    Male     12                   65.0         NaN
S0002        19  Female      9                   58.0        80.0
S0003        14  Female     12                    NaN        83.0
S0004        18  Female      9                   68.0        68.0
S0005        14    Male     10                   80.0        41.0
...         ...     ...    ...                    ...         ...
S0144        14    Male     11                   94.0         NaN
S0145        19    Male     12                   56.0        83.0
S0146        19  Female     12                    NaN        51.0
S0147        19    Male     11                   54.0        96.0
S0148        19  Female     11                   91.0        65.0

            Science_Score  English_Score  Final_Percentage
Student_ID
S0001                 NaN           72.0             50.33
S0002                44.0           35.0             53.00
S0003                73.0           59.0             71.67
S0004                 NaN           77.0             64.33
S0005                 NaN           36.0             41.00
...                   ...            ...               ...
S0144                 NaN           82.0             64.33
S0145                 NaN           97.0             93.00
S0146                48.0           44.0             47.67
S0147                56.0           50.0             67.33
S0148                51.0           65.0             60.33

[148 rows x 8 columns]

# Renaming columns

In [190]:
df = pd.read_csv('student_performance.csv')
df = df.rename(columns={'Math_Score': 'Maths'})
print(df)

    Student_ID  Age  Gender  Class  Attendance_Percentage  Maths  \
0        S0001   15    Male     12                   65.0    NaN
1        S0002   19  Female      9                   58.0   80.0
2        S0003   14  Female     12                    NaN   83.0
3        S0004   18  Female      9                   68.0   68.0
4        S0005   14    Male     10                   80.0   41.0
..         ...  ...     ...    ...                    ...    ...
143      S0144   14    Male     11                   94.0    NaN
144      S0145   19    Male     12                   56.0   83.0
145      S0146   19  Female     12                    NaN   51.0
146      S0147   19    Male     11                   54.0   96.0
147      S0148   19  Female     11                   91.0   65.0

     Science_Score  English_Score  Final_Percentage
0              NaN           72.0             50.33
1             44.0           35.0             53.00
2             73.0           59.0             71.67
3              NaN           77.0             64.33
4              NaN           36.0             41.00
..             ...            ...               ...
143            NaN           82.0             64.33
144            NaN           97.0             93.00
145           48.0           44.0             47.67
146           56.0           50.0             67.33
147           51.0           65.0             60.33

[148 rows x 9 columns]

In [191]:
# you can also rename multiple columns by passing a dictionary of old and new column names
df = df.rename(columns={'Math_Score': 'Maths', 'Science_Score':'Science'})
print(df)

    Student_ID  Age  Gender  Class  Attendance_Percentage  Maths  Science  \
0        S0001   15    Male     12                   65.0    NaN      NaN
1        S0002   19  Female      9                   58.0   80.0     44.0
2        S0003   14  Female     12                    NaN   83.0     73.0
3        S0004   18  Female      9                   68.0   68.0      NaN
4        S0005   14    Male     10                   80.0   41.0      NaN
..         ...  ...     ...    ...                    ...    ...      ...
143      S0144   14    Male     11                   94.0    NaN      NaN
144      S0145   19    Male     12                   56.0   83.0      NaN
145      S0146   19  Female     12                    NaN   51.0     48.0
146      S0147   19    Male     11                   54.0   96.0     56.0
147      S0148   19  Female     11                   91.0   65.0     51.0

     English_Score  Final_Percentage
0             72.0             50.33
1             35.0             53.00
2             59.0             71.67
3             77.0             64.33
4             36.0             41.00
..             ...               ...
143           82.0             64.33
144           97.0             93.00
145           44.0             47.67
146           50.0             67.33
147           65.0             60.33

[148 rows x 9 columns]

In [192]:
# rename index 0, 1 and 2 and update the dataframe
df.set_index('Student_ID',inplace = True)
df.rename(index={'Student_ID':'ID'}, inplace=True)
df

,Age,Gender,Class,Attendance_Percentage,Maths,Science,English_Score,Final_Percentage
Student_ID,,,,,,,,
S0001,15,Male,12,65.0,NaN,NaN,72.0,50.33
S0002,19,Female,9,58.0,80.0,44.0,35.0,53.00
S0003,14,Female,12,NaN,83.0,73.0,59.0,71.67
S0004,18,Female,9,68.0,68.0,NaN,77.0,64.33
S0005,14,Male,10,80.0,41.0,NaN,36.0,41.00
...,...,...,...,...,...,...,...,...
S0144,14,Male,11,94.0,NaN,NaN,82.0,64.33
S0145,19,Male,12,56.0,83.0,NaN,97.0,93.00
S0146,19,Female,12,NaN,51.0,48.0,44.0,47.67
S0147,19,Male,11,54.0,96.0,56.0,50.0,67.33
S0148,19,Female,11,91.0,65.0,51.0,65.0,60.33

# loc and iloc
loc is used for slecting rows or columns based on labels(index) of them<br>
iloc is used selection rows and columns based on integer position of them

In [193]:
df = pd.DataFrame({
    'Name' : ['Ninja_1','Ninja_2','Ninja_3','Ninja_4'],
    'Department' : ['Marketing','Sales','Marketing','Engineering'],
    'Salary' : [50000,60000,55000,70000]

})
print(df)

      Name   Department  Salary
0  Ninja_1    Marketing   50000
1  Ninja_2        Sales   60000
2  Ninja_3    Marketing   55000
3  Ninja_4  Engineering   70000

the index of Name is 0, index of Department is 1, index of Salary is 2

In [194]:
# Selecting A Single 
df.loc[2]

Name            Ninja_3
Department    Marketing
Salary            55000
Name: 2, dtype: object

In [195]:
# Selecting Multiple Rows
df.loc[[1, 2, 3]]
# As you can see, the rows with labels '1','2','3' are selected. Here it is indicating towards the second, third and fourth rows in DataFrame since Python uses 0-based indexing technique.

      Name   Department  Salary
1  Ninja_2        Sales   60000
2  Ninja_3    Marketing   55000
3  Ninja_4  Engineering   70000

In [196]:
# Selecting Multiple Columns
df.loc[:, ['Name', 'Salary']]

      Name  Salary
0  Ninja_1   50000
1  Ninja_2   60000
2  Ninja_3   55000
3  Ninja_4   70000

In [197]:
# Selecting A Subset Of Rows And Columns
df.loc[1:2, ['Name', 'Salary']]

      Name  Salary
1  Ninja_2   60000
2  Ninja_3   55000

In [198]:
# updating the values of the dataframe using loc method
df.loc[1, 'Salary'] = 65000
print(df)

      Name   Department  Salary
0  Ninja_1    Marketing   50000
1  Ninja_2        Sales   65000
2  Ninja_3    Marketing   55000
3  Ninja_4  Engineering   70000

In [199]:
df = pd.read_csv('/Users/ypragnesh/Desktop/Pandas_Notes/student_performance.csv')
print(df.head())

  Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
0      S0001   15    Male     12                   65.0         NaN
1      S0002   19  Female      9                   58.0        80.0
2      S0003   14  Female     12                    NaN        83.0
3      S0004   18  Female      9                   68.0        68.0
4      S0005   14    Male     10                   80.0        41.0

   Science_Score  English_Score  Final_Percentage
0            NaN           72.0             50.33
1           44.0           35.0             53.00
2           73.0           59.0             71.67
3            NaN           77.0             64.33
4            NaN           36.0             41.00

In [200]:
# we can select particular column from the dataframe using column name
# df.loc[row_labels, column_labels]
print(df.loc[:, 'Math_Score'])

0       NaN
1      80.0
2      83.0
3      68.0
4      41.0
       ...
143     NaN
144    83.0
145    51.0
146    96.0
147    65.0
Name: Math_Score, Length: 148, dtype: float64

In [201]:
df.loc[:, ["Math_Score", "Science_Score"]]

     Math_Score  Science_Score
0           NaN            NaN
1          80.0           44.0
2          83.0           73.0
3          68.0            NaN
4          41.0            NaN
..          ...            ...
143         NaN            NaN
144        83.0            NaN
145        51.0           48.0
146        96.0           56.0
147        65.0           51.0

[148 rows x 2 columns]

In [ ]:
# updating values
df.loc[1, 'Math_Score'] = 95
print(df)
# so if you see the output the value of maths score is changed from ₹88 to 95 for the student with index 1. This is how we can update the values in a dataframe using loc method.

    Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
0        S0001   15    Male     12                   65.0         NaN
1        S0002   95  Female      9                   58.0        95.0
2        S0003   14  Female     12                    NaN        83.0
3        S0004   18  Female      9                   68.0        68.0
4        S0005   14    Male     10                   80.0        41.0
..         ...  ...     ...    ...                    ...         ...
143      S0144   14    Male     11                   94.0         NaN
144      S0145   19    Male     12                   56.0        83.0
145      S0146   19  Female     12                    NaN        51.0
146      S0147   19    Male     11                   54.0        96.0
147      S0148   19  Female     11                   91.0        65.0

     Science_Score  English_Score  Final_Percentage
0              NaN           72.0             50.33
1             44.0           35.0             53.00
2             73.0           59.0             71.67
3              NaN           77.0             64.33
4              NaN           36.0             41.00
..             ...            ...               ...
143            NaN           82.0             64.33
144            NaN           97.0             93.00
145           48.0           44.0             47.67
146           56.0           50.0             67.33
147           51.0           65.0             60.33

[148 rows x 9 columns]

# iloc

In [202]:

df = pd.DataFrame({
    'Name' : ['Ninja_1','Ninja_2','Ninja_3','Ninja_4'],
    'Department' : ['Marketing','Sales','Marketing','Engineering'],
    'Salary' : [50000,60000,55000,70000]

})
print(df)

      Name   Department  Salary
0  Ninja_1    Marketing   50000
1  Ninja_2        Sales   60000
2  Ninja_3    Marketing   55000
3  Ninja_4  Engineering   70000

In [203]:
# Selecting Specific Rows And Columns
# df.iloc[row_positions, column_positions]
row = df.iloc[[1,3], [0,2]]
print(row)

      Name  Salary
1  Ninja_2   60000
3  Ninja_4   70000

In [204]:
# Updating Values

df.iloc[1,2] = 100
print(df)

      Name   Department  Salary
0  Ninja_1    Marketing   50000
1  Ninja_2        Sales     100
2  Ninja_3    Marketing   55000
3  Ninja_4  Engineering   70000

In [205]:
# slicing the dataframe using iloc method
df.iloc[0:3, 0:2]

      Name Department
0  Ninja_1  Marketing
1  Ninja_2      Sales
2  Ninja_3  Marketing

In [206]:
import pandas as pd
df = pd.read_csv('/Users/ypragnesh/Desktop/Pandas_Notes/student_performance.csv')
print(df.head())

  Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
0      S0001   15    Male     12                   65.0         NaN
1      S0002   19  Female      9                   58.0        80.0
2      S0003   14  Female     12                    NaN        83.0
3      S0004   18  Female      9                   68.0        68.0
4      S0005   14    Male     10                   80.0        41.0

   Science_Score  English_Score  Final_Percentage
0            NaN           72.0             50.33
1           44.0           35.0             53.00
2           73.0           59.0             71.67
3            NaN           77.0             64.33
4            NaN           36.0             41.00

In [207]:
# Selecting Specific Rows And Columns
df.iloc[[1,3], [0,2]]
# here we are selecting the second and fourth row and first and third column of the dataframe using iloc method. The output will be a new dataframe containing the selected rows and columns.

  Student_ID  Gender
1      S0002  Female
3      S0004  Female

In [208]:
# df.iloc[row_positions, column_positions]
print(df.iloc[0:5, 0:3])

  Student_ID  Age  Gender
0      S0001   15    Male
1      S0002   19  Female
2      S0003   14  Female
3      S0004   18  Female
4      S0005   14    Male

In [210]:
# updating values
df.iloc[1, 1] = 95
print(df)
# so if you see the output the value of age is changed from 88 to 95 for the student with index 1. This is how we can update the values in a dataframe using iloc method.

    Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
0        S0001   15    Male     12                   65.0         NaN
1        S0002   95  Female      9                   58.0        80.0
2        S0003   14  Female     12                    NaN        83.0
3        S0004   18  Female      9                   68.0        68.0
4        S0005   14    Male     10                   80.0        41.0
..         ...  ...     ...    ...                    ...         ...
143      S0144   14    Male     11                   94.0         NaN
144      S0145   19    Male     12                   56.0        83.0
145      S0146   19  Female     12                    NaN        51.0
146      S0147   19    Male     11                   54.0        96.0
147      S0148   19  Female     11                   91.0        65.0

     Science_Score  English_Score  Final_Percentage
0              NaN           72.0             50.33
1             44.0           35.0             53.00
2             73.0           59.0             71.67
3              NaN           77.0             64.33
4              NaN           36.0             41.00
..             ...            ...               ...
143            NaN           82.0             64.33
144            NaN           97.0             93.00
145           48.0           44.0             47.67
146           56.0           50.0             67.33
147           51.0           65.0             60.33

[148 rows x 9 columns]